public class HomeWork {
    /**
     * Писать код с использованием Stream API
     * 1) Создать класс Student, содержащий следующие характеристики – имя, группа, курс, оценки по предметам.
     * Создать коллекцию, содержащую объекты класса Student. Перебрать всех студентов, вычислить средний балл
     * каждого студента. Если средний балл >=3, студент переводится на следующий курс, иначе отчисляется.
     *
     * 2) Напишите программу, читающую из System.in текст в кодировке UTF-8,
     * подсчитывающую в нем частоту появления слов, и в конце выводящую 10 наиболее
     * часто встречающихся слов.
     *
     * Словом будем считать любую непрерывную последовательность символов, состоящую
     * только из букв и цифр. Например, в строке "Мама мыла раму 33 раза!" ровно пять слов:
     * "Мама", "мыла", "раму", "33" и "раза".
     *
     * Подсчет слов должен выполняться без учета регистра, т.е. "МАМА", "мама" и "Мама" —
     * это одно и то же слово. Выводите слова в нижнем регистре.
     *
     * Если в тексте меньше 10 уникальных слов, то выводите сколько есть.
     *
     * Если в тексте некоторые слова имеют одинаковую частоту, т.е. их нельзя
     * однозначно упорядочить только по частоте, то дополнительно упорядочите слова
     * с одинаковой частотой в лексикографическом порядке.
     *
     * Задача имеет красивое решение через стримы без циклов и условных операторов. Попробуйте придумать его.
     */
}
